unfdemo.BS_Billing/src/InformationRegisters/BS_ЗарегистрированныеОбъектыБиллинга/BS_ЗарегистрированныеОбъектыБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BS_ЗарегистрированныеОбъектыБиллинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СрокОплатыПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

unfdemo.BS_Billing/src/CommonModules/BS_РегистрацияОбъектовБиллингаВызовСервера/Module.bsl
Процедура ЗарегистрироватьОбъект(Источник) Экспорт
	
	Объект = Источник.Ссылка;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.BS_ЗарегистрированныеОбъектыБиллинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период					= Объект.Дата;
	НоваяЗапись.Объект 					= Объект;
	НоваяЗапись.СрокОплатыПокупателя 	= Объект.Договор.СрокОплатыПокупателя;
	НоваяЗапись.ДатаОстановки			= Объект.Дата + 86400 * НоваяЗапись.СрокОплатыПокупателя;	
	
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеЗарегистрированногоОбъекта(Объект) Экспорт
	
	НаборЗаписей = РегистрыСведений.BS_ЗарегистрированныеОбъектыБиллинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Записать();             
	
КонецПроцедуры
